artillery-light.yml
config:
  target: "http://localhost:3000"
  phases:
    # Much lighter load to avoid database overload
    - duration: 20
      arrivalRate: 1 # Only 1 user per second
      name: "Very light warm up"
    - duration: 30
      arrivalRate: 2 # 2 users per second
      name: "Light load"
    - duration: 20
      arrivalRate: 3 # 3 users per second
      name: "Moderate load"
  processor: "./artillery-processor.js"

scenarios:
  - name: "Light Invoice Creation Test"
    weight: 100
    flow:
      - function: "generateInvoiceData"
      - post:
          url: "/api/v1/invoices"
          headers:
            Content-Type: "application/json"
          json:
            agency_id: "{{ agency_id }}"
            user_id: "{{ user_id }}"
            customer_id: "{{ customer_id }}"
            receiver_id: "{{ receiver_id }}"
            service_id: "{{ service_id }}"
            items: "{{ items }}"
            paid_in_cents: "{{ paid_in_cents }}"
            total_in_cents: "{{ total_in_cents }}"
          expect:
            - statusCode: [200, 201]
            - hasProperty: "id"
          capture:
            - json: "$.id"
              as: "invoice_id"
      - think: 3 # 3 second pause between requests (very conservative)