artillery-test.yml
config:
   target: "http://localhost:3000" # Adjust to your server URL
   http:
      timeout: 30
   defaults:
      headers:
         Authorization: "Bearer p5TAuBi2u8lH3JUV9a7E3kNCPuPvDDV4"
   phases:
      - duration: 30
        arrivalRate: 5 # 5 users per second
        name: "Warm up"
      - duration: 60
        arrivalRate: 15 # 15 users per second
        name: "Sustained load"
      - duration: 30
        arrivalRate: 25 # 25 users per second
        name: "Peak load"
      - duration: 60
        arrivalRate: 40 # 40 users per second
        name: "Maximum stress"
   processor: "./artillery-processor.js"
   plugins:
      metrics-by-endpoint:
         useOnlyRequestNames: true

scenarios:
   # Initialize data from database before running any scenarios
   - name: "Initialize Database Data"
     weight: 1
     flow:
        - function: "initializeData"
   - name: "Order Creation Stress Test"
     weight: 80
     flow:
        - function: "generateOrderData"
        - post:
             url: "/api/v1/orders"
             headers:
                Content-Type: "application/json"
             json:
                agency_id: "{{ agency_id }}"
                user_id: "{{ user_id }}"
                customer_id: "{{ customer_id }}"
                receiver_id: "{{ receiver_id }}"
                service_id: "{{ service_id }}"
                items: "{{ items }}"
                paid_in_cents: "{{ paid_in_cents }}"
                total_in_cents: "{{ total_in_cents }}"
             expect:
                - statusCode: [200, 201]
                - hasProperty: "id"
             capture:
                - json: "$.id"
                  as: "order_id"
        - think: 1 # 1 second pause between requests

   - name: "Complex Order Creation"
     weight: 20
     flow:
        - function: "generateComplexOrderData"
        - post:
             url: "/api/v1/orders"
             headers:
                Content-Type: "application/json"
             json:
                agency_id: "{{ agency_id }}"
                user_id: "{{ user_id }}"
                customer_id: "{{ customer_id }}"
                receiver_id: "{{ receiver_id }}"
                service_id: "{{ service_id }}"
                items: "{{ complex_items }}"
             expect:
                - statusCode: [200, 201]
                - hasProperty: "id"
             capture:
                - json: "$.id"
                  as: "complex_order_id"
        - think: 2 # 2 second pause for complex orders